# Exercise 4.6 - Combining & Exporting data

# Importing libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

# Importing data

In [3]:
path = r'C:\Users\srira\OneDrive\Documents\Instacart Basket Analysis'

In [6]:
# Importing data file - orders_products_combined.pkl
df_combined = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [14]:
# Importing data file - products_checked.csv
df_prds = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

# Question 4: Shape of the orders_products_combined dataframe

In [8]:
# Checking the shape of the dataframe orders_products_combined.pkl
df_combined.shape

(32434489, 12)

# Question 5: Combining the data frames orders_products_combined and products_checked

In [9]:
# Checking the output for df_combined
df_combined.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [15]:
# Checking the output for df_prds
df_prds.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [12]:
df_combined.shape

(32434489, 12)

In [16]:
df_prds.shape

(49672, 6)

In [17]:
# Drop unnamed columns and _merge column from the df_combined dataframe
df_combined = df_combined.drop(columns = ['Unnamed: 0.1', 'Unnamed: 0', '_merge'])

In [18]:
# Check output for df_combined
df_combined.head()

,order_id,user_id,order_number,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [19]:
# Drop unnamed columns from the df_prds dataframe
df_prds = df_prds.drop(columns = ['Unnamed: 0'])

In [20]:
# Check output for df_prds
df_prds.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [21]:
df_combined.shape

(32434489, 9)

In [22]:
df_prds.shape

(49672, 5)

In [23]:
# Combining orders_products_combined with the products_checked data set using the "product_id" as the key

df_ords_prods_merge = df_combined.merge(df_prds, on = 'product_id', indicator = True)

In [24]:
# Checking the output for the new dataframe
df_ords_prods_merge.head()

,order_id,user_id,order_number,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

# Question 6: Confirm the results of the merge using the merge flag

In [26]:
# Results of the _merge column
df_ords_prods_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

# Question 7: Exporting data

In [27]:
# Exporting the newly created dataframe df_ords_prods_merge

df_ords_prods_merge.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged.pkl'))